// app/components/FeaturesSection.jsx
import React from "react";

const FeaturesSection = () => {
  const features = [
    "النسخ الاحتياطي والاستعادة للبيئات المادية والافتراضية والسحابية.",
    "الحماية من البرامج الضارة ومكافحة الفدية.",
    "حماية الأجهزة الطرفية وإدارتها.",
    "الكشف عن التهديدات المتقدمة والاستجابة لها.",
    "حماية البريد الإلكتروني وأرشفته.",
    "التعافي من الكوارث عبر السحابة.",
    "الإدارة والتحكم المركزي.",
    "الإدارة والتحكم المركزي.",
    "الإدارة والتحكم المركزي.",
  ];

  const icon = (
    <img
      src="data:image/svg+xml,%3csvg%20width='24'%20height='24'%20viewBox='0%200%2024%2024'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3cg%20clip-path='url(%23clip0_9_78481)'%3e%3cpath%20d='M12%200C5.37262%200%200%205.37262%200%2012C0%2018.6277%205.37262%2024%2012%2024C18.6277%2024%2024%2018.6277%2024%2012C24%205.37262%2018.6277%200%2012%200ZM12%2022.5236C6.21037%2022.5236%201.5%2017.7896%201.5%2012C1.5%206.21033%206.21037%201.49995%2012%201.49995C17.7896%201.49995%2022.5%206.21035%2022.5%2012C22.5%2017.7896%2017.7896%2022.5236%2012%2022.5236ZM16.7891%207.60913L9.74848%2014.694L6.57785%2011.5234C6.28498%2011.2305%205.81023%2011.2305%205.51698%2011.5234C5.2241%2011.8162%205.2241%2012.291%205.51698%2012.5839L9.2291%2016.2964C9.52198%2016.5889%209.99673%2016.5889%2010.29%2016.2964C10.3237%2016.2626%2010.3526%2016.2259%2010.3789%2016.1876L17.8504%208.66998C18.1429%208.3771%2018.1429%207.90235%2017.8504%207.60913C17.5571%207.31625%2017.0824%207.31625%2016.7891%207.60913Z'%20fill='black'/%3e%3c/g%3e%3cdefs%3e%3cclipPath%20id='clip0_9_78481'%3e%3crect%20width='24'%20height='24'%20fill='white'/%3e%3c/clipPath%3e%3c/defs%3e%3c/svg%3e"
      alt="check icon"
      className="w-6 h-6 flex-shrink-0"
    />
  );

  return (
    <section className="my-12">
      <h1 className="lg:text-4xl text-xl mb-6 text-center my-36">المزايا الرئيسية</h1>
      <div className="grid lg:grid-cols-3 md:grid-cols-2 grid-cols-1 gap-4 gap-y-8 my-12">
        {features.map((feature, index) => (
          <div key={index} className="flex items-start gap-2 mx-16">
            {icon}
            <p className="text-gray-800">{feature}</p>
          </div>
        ))}
      </div>
    </section>
  );
};

export default FeaturesSection;